Terraform will perform the following actions:

  # aws_cloudwatch_dashboard.idv_hybrid_handoff will be created
  + resource "aws_cloudwatch_dashboard" "idv_hybrid_handoff" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + start   = "-PT72H"
              + widgets = [
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE 'ryandbrown_/srv/idp/shared/log/events.log' | filter name = "IdV: doc auth upload submitted" and !properties.event_properties.skip_upload_step
                                | fields properties.event_properties.destination as destination
                                | fields destination = "link_sent" as link, destination = "document_capture" as desktop
                                | stats sum(link) as switched_to_mobile, sum(desktop) as stayed_on_desktop by bin(1hour)
                            EOT
                          + region  = "us-west-2"
                          + stacked = true
                          + title   = "Absolute number of users"
                          + view    = "timeSeries"
                        }
                      + type       = "log"
                      + width      = 12
                      + x          = 12
                      + y          = 3
                    },
                  + {
                      + height     = 3
                      + properties = {
                          + markdown = <<-EOT
                                # Hybrid vs Desktop selection
                                Among those who completed the hybrid handoff screen, two graphs showing the number of users who switched to a mobile device, thus joining the hybrid workflow, and those who stayed with desktop workflow.
                            EOT
                        }
                      + type       = "text"
                      + width      = 12
                      + x          = 12
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE 'ryandbrown_/srv/idp/shared/log/events.log' | filter name = "IdV: doc auth upload submitted"
                                | fields properties.event_properties.skip_upload_step as skip
                                | stats avg(!skip)*100 as did_hybrid_handoff by bin(1hour)
                            EOT
                          + region  = "us-west-2"
                          + stacked = true
                          + title   = "Percentage who completed handoff"
                          + view    = "timeSeries"
                        }
                      + type       = "log"
                      + width      = 12
                      + x          = 0
                      + y          = 9
                    },
                  + {
                      + height     = 3
                      + properties = {
                          + markdown = <<-EOT
                                # Who completed handoff?
                                Two graphs showing the users who saw and completed the "hybrid handoff" screen (desktop users) and those who never saw the screen (mobile users). Users who saw but didn't complete the screen are not included.
                            EOT
                        }
                      + type       = "text"
                      + width      = 12
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE 'ryandbrown_/srv/idp/shared/log/events.log' | filter name = "IdV: doc auth image upload vendor submitted" and properties.new_event
                                | fields properties.event_properties.flow_path = 'standard' and !properties.browser_mobile as is_desktop
                                | fields properties.event_properties.flow_path = 'hybrid' as is_hybrid
                                | fields properties.browser_mobile as is_mobile
                                | fields is_desktop and properties.event_properties.success as desktop_success
                                | fields is_hybrid and properties.event_properties.success as hybrid_success
                                | fields is_mobile and properties.event_properties.success as mobile_success
                                | stats
                                (sum(desktop_success)/sum(is_desktop))*100 as desktop,
                                (sum(hybrid_success)/sum(is_hybrid))*100 as hybrid,
                                (sum(mobile_success)/sum(is_mobile))*100 as mobile by bin(1h)
                            EOT
                          + region  = "us-west-2"
                          + stacked = false
                          + title   = "Success rate of users who submit documents (successful doc auth submissions / total submissions)"
                          + view    = "timeSeries"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 29
                    },
                  + {
                      + height     = 2
                      + properties = {
                          + markdown = <<-EOT
                                # Document upload behaviour
                                Metrics of how successful people were at adding images of their identifying documents via our vendors
                            EOT
                        }
                      + type       = "text"
                      + width      = 24
                      + x          = 0
                      + y          = 15
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE 'ryandbrown_/srv/idp/shared/log/events.log' | filter name = "IdV: doc auth image upload vendor submitted" and properties.new_event = 1
                                | fields properties.event_properties.attempts as att 
                                | stats avg(att) as num_upload_attempts by bin(1h)
                            EOT
                          + region  = "us-west-2"
                          + stacked = false
                          + title   = "Average number of upload attempts"
                          + view    = "timeSeries"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 35
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE 'ryandbrown_/srv/idp/shared/log/events.log' | filter name in ["IdV: doc auth document_capture visited", "Frontend: IdV: Link sent capture doc polling started"] and !properties.browser_bot and properties.new_event
                                | fields @timestamp, name, properties.browser_platform_name as platform,
                                properties.browser_name as browser, properties.event_properties.flow_path as path
                                | stats
                                sum(name = "Frontend: IdV: Link sent capture doc polling started") as hybrid_links_sent,
                                sum(path = "hybrid" and name = "IdV: doc auth document_capture visited") as hybrid_links_clicked
                                by bin(1hr)
                            EOT
                          + region  = "us-west-2"
                          + stacked = false
                          + title   = "Number of hybrid links we send and number that get clicked on (clicks are higher than sends for unknown reasons)"
                          + view    = "timeSeries"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 43
                    },
                  + {
                      + height     = 2
                      + properties = {
                          + markdown = <<-EOT
                                # Hybrid link behaviour
                                Number people who get a hybrid link texted to them, and the number who open it
                            EOT
                        }
                      + type       = "text"
                      + width      = 24
                      + x          = 0
                      + y          = 41
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE 'ryandbrown_/srv/idp/shared/log/events.log' | filter name = "IdV: doc auth upload submitted"
                                | fields properties.event_properties.skip_upload_step as skip_upload_step
                                | stats sum(!skip_upload_step) as hybrid_step_submitted, sum(skip_upload_step) as hybrid_step_skipped by bin(1hour)
                            EOT
                          + region  = "us-west-2"
                          + stacked = true
                          + title   = "Absolute number of users"
                          + view    = "timeSeries"
                        }
                      + type       = "log"
                      + width      = 12
                      + x          = 0
                      + y          = 3
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE 'ryandbrown_/srv/idp/shared/log/events.log' | filter name = "IdV: doc auth upload submitted" and !properties.event_properties.skip_upload_step
                                | fields properties.event_properties.destination as destination
                                | fields destination = "link_sent" as mobile
                                | stats avg(mobile)*100 as switched_to_mobile by bin(1hour)
                            EOT
                          + region  = "us-west-2"
                          + stacked = true
                          + title   = "Percentage who chose mobile at the hybrid handoff screen"
                          + view    = "timeSeries"
                        }
                      + type       = "log"
                      + width      = 12
                      + x          = 12
                      + y          = 9
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE 'ryandbrown_/srv/idp/shared/log/events.log' | filter name in ["IdV: doc auth document_capture visited", "Frontend: IdV: front image added"] and properties.new_event
                                # records of starting doc capture
                                | fields properties.event_properties.flow_path = 'standard' and name = "IdV: doc auth document_capture visited" and !properties.browser_mobile as started_desktop
                                | fields properties.event_properties.flow_path = 'hybrid' and name = "IdV: doc auth document_capture visited" as started_hybrid
                                | fields properties.browser_mobile and name = "IdV: doc auth document_capture visited" as started_mobile
                                # records of finishing the capture
                                | fields properties.event_properties.flow_path = 'standard' and name = "Frontend: IdV: front image added" and !properties.browser_mobile as added_desktop
                                | fields properties.event_properties.flow_path = 'hybrid' and name = "Frontend: IdV: front image added" as added_hybrid
                                | fields properties.browser_mobile and name = "Frontend: IdV: front image added" as added_mobile
                                # convert to percentages
                                | stats
                                (sum(added_desktop)/sum(started_desktop))*100 as desktop,
                                (sum(added_hybrid)/sum(started_hybrid))*100 as hybrid,
                                (sum(added_mobile)/sum(started_mobile))*100 as mobile by bin(1h)
                            EOT
                          + region  = "us-west-2"
                          + stacked = false
                          + title   = "Rate of front image upload (front image uploads / number of visits)"
                          + view    = "timeSeries"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 17
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query   = <<-EOT
                                SOURCE 'ryandbrown_/srv/idp/shared/log/events.log' | filter (name = "IdV: doc auth image upload vendor submitted" and properties.new_event and properties.event_properties.success) or (name = 'IdV: doc auth document_capture visited' and properties.new_event)
                                | fields properties.event_properties.flow_path = 'standard' and !properties.browser_mobile as is_desktop
                                | fields properties.event_properties.flow_path = 'hybrid' as is_hybrid
                                | fields properties.browser_mobile as is_mobile
                                | fields name = 'IdV: doc auth document_capture visited' as visited, name = "IdV: doc auth image upload vendor submitted" as success
                                | fields is_desktop and success as desktop_success, is_desktop and visited as desktop_visited
                                | fields is_hybrid and success as hybrid_success, is_hybrid and visited as hybrid_visited
                                | fields is_mobile and success as mobile_success, is_mobile and visited as mobile_visited
                                | stats
                                (sum(desktop_success)/sum(desktop_visited))*100 as desktop,
                                (sum(hybrid_success)/sum(hybrid_visited))*100 as hybrid,
                                (sum(mobile_success)/sum(mobile_visited))*100 as mobile by bin(1h)
                            EOT
                          + region  = "us-west-2"
                          + stacked = false
                          + title   = "Success rate of users who reach document capture (successful doc auth submissions / number of visits)"
                          + view    = "timeSeries"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 23
                    },
                ]
            }
        )
      + dashboard_name = "ryandbrown-idv-hybrid-handoff"
      + id             = (known after apply)
    }

  # aws_cloudwatch_log_metric_filter.idp_worker["attempts_api_batch_job_not_run"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "idp_worker" {
      + id             = (known after apply)
      + log_group_name = "ryandbrown_/srv/idp/shared/log/workers.log"
      + name           = "attempts-api-batch-job-performed"
      + pattern        = "{ $.name = \"perform.active_job\" && $.exception_message NOT EXISTS && $.queue_name = \"*GoodJob*\" && $.job_class = \"IrsAttemptsEventsBatchJob\" }"

      + metric_transformation {
          + name      = "attempts-api-batch-job-performed"
          + namespace = "ryandbrown/idp-worker"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.attempts_api_worker_not_run will be created
  + resource "aws_cloudwatch_metric_alarm" "attempts_api_worker_not_run" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-west-2:894947205914:slack-otherevents",
        ]
      + alarm_description                     = <<-EOT
            ryandbrown: The IRS Attempts API data Worker batch job has not run in over an hour.
            
            See: https://github.com/18F/identity-devops/wiki/Runbook:-IRS-Attempts-API-BatchJob-Not-Run
        EOT
      + alarm_name                            = "ryandbrown-AttemptsAPI-BatchJob-Not-Run"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 1
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "attempts-api-batch-job-performed"
      + namespace                             = "ryandbrown/idp-worker"
      + period                                = 7200
      + statistic                             = "Maximum"
      + tags_all                              = {
          + "fisma" = "Q-LG"
        }
      + threshold                             = 1
      + treat_missing_data                    = "breaching"
    }

  # aws_s3_object.version_info will be updated in-place
  ~ resource "aws_s3_object" "version_info" {
      ~ content                = <<-EOT
          - main_commit=fc042e36efbf706029aa542fa2e21f8a95843c18
          - main_branch=ryandbrown/kms_region_fixes
          - main_version=pre-257
          - private_commit=1720d250bc6b8447594380c91e8217ab7b5d780c
          + main_commit=0b6e84076c03fcb69147e651c02ad39161f28e48
          + main_branch=main
          + main_version=pre-258
          + private_commit=478d1655e69ffc906435a5ddadc9e0cd74d1957a
            private_branch=main
        EOT
        id                     = "terraform-app/version_info/ryandbrown.txt"
        tags                   = {}
      ~ version_id             = "Zt9SOXmqe3OzB0XL9Mp979nuCSoZL0T1" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.app_launch_template[0].aws_launch_template.template will be updated in-place
  ~ resource "aws_launch_template" "template" {
        id                                   = "lt-065fb4bbd1a87f07d"
      ~ image_id                             = "ami-0abcba810fbc96527" -> "ami-0f508feb92d46e704"
      ~ latest_version                       = 2 -> (known after apply)
        name                                 = "ryandbrown-app20230419182036051500000044"
        tags                                 = {
            "domain"       = "ryandbrown.identitysandbox.gov"
            "main_git_ref" = "stages/ryandbrown"
            "prefix"       = "app"
        }
        # (16 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.idp_launch_template.aws_launch_template.template will be updated in-place
  ~ resource "aws_launch_template" "template" {
        id                                   = "lt-0e942e065e35bedda"
      ~ image_id                             = "ami-0abcba810fbc96527" -> "ami-0f508feb92d46e704"
      ~ latest_version                       = 2 -> (known after apply)
        name                                 = "ryandbrown-idp2023041918200280590000003d"
        tags                                 = {
            "domain"       = "ryandbrown.identitysandbox.gov"
            "main_git_ref" = "stages/ryandbrown"
            "prefix"       = "idp"
        }
        # (16 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.kms_keymaker_multiregion_primary_uw2.data.aws_iam_policy_document.kms_events_topic_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "kms_events_topic_policy" {
      + id        = (known after apply)
      + json      = (known after apply)
      + policy_id = "kms_ct_sqs"

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "KMSCTSQS"

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.kms_keymaker_multiregion_primary_uw2.aws_cloudwatch_event_rule.replicate will be destroyed
  # (because aws_cloudwatch_event_rule.replicate is not in configuration)
  - resource "aws_cloudwatch_event_rule" "replicate" {
      - arn            = "arn:aws:events:us-west-2:894947205914:rule/ryandbrown-mr-replicate-events" -> null
      - description    = "Capture disallowed replicate events" -> null
      - event_bus_name = "default" -> null
      - event_pattern  = jsonencode(
            {
              - eventName         = [
                  - "ReplicateKey",
                ]
              - eventSource       = [
                  - "kms.amazonaws.com",
                ]
              - requestParameters = {
                  - keyId         = [
                      - "mrk-2631d5901d8b4eee920fac69d8f84c33",
                    ]
                  - replicaRegion = [
                      - {
                          - anything-but = [
                              - "us-west-2",
                              - "us-east-1",
                            ]
                        },
                    ]
                }
            }
        ) -> null
      - id             = "ryandbrown-mr-replicate-events" -> null
      - is_enabled     = true -> null
      - name           = "ryandbrown-mr-replicate-events" -> null
      - tags           = {} -> null
      - tags_all       = {
          - "fisma" = "Q-LG"
        } -> null
    }

  # module.kms_keymaker_multiregion_primary_uw2.aws_cloudwatch_event_rule.update_primary_region will be destroyed
  # (because aws_cloudwatch_event_rule.update_primary_region is not in configuration)
  - resource "aws_cloudwatch_event_rule" "update_primary_region" {
      - arn            = "arn:aws:events:us-west-2:894947205914:rule/ryandbrown-mr-update-primary-region-events" -> null
      - description    = "Capture disallowed update primary region events" -> null
      - event_bus_name = "default" -> null
      - event_pattern  = jsonencode(
            {
              - eventName         = [
                  - "UpdatePrimaryRegion",
                ]
              - eventSource       = [
                  - "kms.amazonaws.com",
                ]
              - requestParameters = {
                  - keyId         = [
                      - "mrk-2631d5901d8b4eee920fac69d8f84c33",
                    ]
                  - primaryRegion = [
                      - {
                          - anything-but = [
                              - "us-west-2",
                              - "us-east-1",
                            ]
                        },
                    ]
                }
            }
        ) -> null
      - id             = "ryandbrown-mr-update-primary-region-events" -> null
      - is_enabled     = true -> null
      - name           = "ryandbrown-mr-update-primary-region-events" -> null
      - tags           = {} -> null
      - tags_all       = {
          - "fisma" = "Q-LG"
        } -> null
    }

  # module.kms_keymaker_multiregion_primary_uw2.aws_cloudwatch_event_target.decrypt will be destroyed
  # (because aws_cloudwatch_event_target.decrypt is not in configuration)
  - resource "aws_cloudwatch_event_target" "decrypt" {
      - arn            = "arn:aws:sns:us-west-2:894947205914:ryandbrown-decryption-events" -> null
      - event_bus_name = "default" -> null
      - id             = "ryandbrown-mr-decryption-events-ryandbrown-sns" -> null
      - rule           = "ryandbrown-mr-decryption-events" -> null
      - target_id      = "ryandbrown-sns" -> null
    }

  # module.kms_keymaker_multiregion_primary_uw2.aws_cloudwatch_event_target.replicate will be destroyed
  # (because aws_cloudwatch_event_target.replicate is not in configuration)
  - resource "aws_cloudwatch_event_target" "replicate" {
      - arn            = "arn:aws:sns:us-west-2:894947205914:ryandbrown-decryption-events" -> null
      - event_bus_name = "default" -> null
      - id             = "ryandbrown-mr-replicate-events-ryandbrown-sns" -> null
      - rule           = "ryandbrown-mr-replicate-events" -> null
      - target_id      = "ryandbrown-sns" -> null
    }

  # module.kms_keymaker_multiregion_primary_uw2.aws_cloudwatch_event_target.sns will be created
  + resource "aws_cloudwatch_event_target" "sns" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "ryandbrown-mr-decryption-events"
      + target_id      = "ryandbrown-sns"
    }

  # module.kms_keymaker_multiregion_primary_uw2.aws_cloudwatch_event_target.update_primary_region will be destroyed
  # (because aws_cloudwatch_event_target.update_primary_region is not in configuration)
  - resource "aws_cloudwatch_event_target" "update_primary_region" {
      - arn            = "arn:aws:sns:us-west-2:894947205914:ryandbrown-decryption-events" -> null
      - event_bus_name = "default" -> null
      - id             = "ryandbrown-mr-update-primary-region-events-ryandbrown-sns" -> null
      - rule           = "ryandbrown-mr-update-primary-region-events" -> null
      - target_id      = "ryandbrown-sns" -> null
    }

  # module.kms_keymaker_multiregion_primary_uw2.aws_sns_topic.kms_events must be replaced
-/+ resource "aws_sns_topic" "kms_events" {
      - application_success_feedback_sample_rate = 0 -> null
      ~ arn                                      = "arn:aws:sns:us-west-2:894947205914:ryandbrown-decryption-events" -> (known after apply)
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      ~ id                                       = "arn:aws:sns:us-west-2:894947205914:ryandbrown-decryption-events" -> (known after apply)
      - lambda_success_feedback_sample_rate      = 0 -> null
      ~ name                                     = "ryandbrown-decryption-events" -> "ryandbrown-mr-decryption-events" # forces replacement
      + name_prefix                              = (known after apply)
      ~ owner                                    = "894947205914" -> (known after apply)
      ~ policy                                   = jsonencode(
            {
              - Id        = "kms_ct_sqs"
              - Statement = [
                  - {
                      - Action    = "SNS:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:us-west-2:894947205914:ryandbrown-decryption-events"
                      - Sid       = "KMSCTSQS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ signature_version                        = 0 -> (known after apply)
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {} -> null
      + tracing_config                           = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.kms_keymaker_multiregion_primary_uw2.aws_sns_topic_policy.kms_events must be replaced
-/+ resource "aws_sns_topic_policy" "kms_events" {
      ~ arn    = "arn:aws:sns:us-west-2:894947205914:ryandbrown-decryption-events" -> (known after apply) # forces replacement
      ~ id     = "arn:aws:sns:us-west-2:894947205914:ryandbrown-decryption-events" -> (known after apply)
      ~ owner  = "894947205914" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Id        = "kms_ct_sqs"
              - Statement = [
                  - {
                      - Action    = "SNS:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:us-west-2:894947205914:ryandbrown-decryption-events"
                      - Sid       = "KMSCTSQS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.kms_keymaker_multiregion_primary_uw2.aws_sns_topic_subscription.kms_ct_sqs must be replaced
-/+ resource "aws_sns_topic_subscription" "kms_ct_sqs" {
      ~ arn                             = "arn:aws:sns:us-west-2:894947205914:ryandbrown-decryption-events:7c3dc31c-781e-4033-81bb-37e848bd2c56" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-west-2:894947205914:ryandbrown-decryption-events:7c3dc31c-781e-4033-81bb-37e848bd2c56" -> (known after apply)
      ~ owner_id                        = "894947205914" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ topic_arn                       = "arn:aws:sns:us-west-2:894947205914:ryandbrown-decryption-events" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.kms_keymaker_multiregion_replica_ue1.data.aws_iam_policy_document.kms_events_topic_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "kms_events_topic_policy" {
      + id        = (known after apply)
      + json      = (known after apply)
      + policy_id = "kms_ct_sqs"

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "KMSCTSQS"

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.kms_keymaker_multiregion_replica_ue1.aws_cloudwatch_event_target.sns will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "sns" {
      ~ arn            = "arn:aws:sns:us-east-1:894947205914:ryandbrown-decryption-events" -> (known after apply)
        id             = "ryandbrown-mr-decryption-events-ryandbrown-sns"
        # (3 unchanged attributes hidden)
    }

  # module.kms_keymaker_multiregion_replica_ue1.aws_sns_topic.kms_events must be replaced
-/+ resource "aws_sns_topic" "kms_events" {
      - application_success_feedback_sample_rate = 0 -> null
      ~ arn                                      = "arn:aws:sns:us-east-1:894947205914:ryandbrown-decryption-events" -> (known after apply)
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      ~ id                                       = "arn:aws:sns:us-east-1:894947205914:ryandbrown-decryption-events" -> (known after apply)
      - lambda_success_feedback_sample_rate      = 0 -> null
      ~ name                                     = "ryandbrown-decryption-events" -> "ryandbrown-mr-decryption-events" # forces replacement
      + name_prefix                              = (known after apply)
      ~ owner                                    = "894947205914" -> (known after apply)
      ~ policy                                   = jsonencode(
            {
              - Id        = "kms_ct_sqs"
              - Statement = [
                  - {
                      - Action    = "SNS:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:894947205914:ryandbrown-decryption-events"
                      - Sid       = "KMSCTSQS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ signature_version                        = 0 -> (known after apply)
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {} -> null
      ~ tags_all                                 = {} -> (known after apply)
      + tracing_config                           = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.kms_keymaker_multiregion_replica_ue1.aws_sns_topic_policy.kms_events must be replaced
-/+ resource "aws_sns_topic_policy" "kms_events" {
      ~ arn    = "arn:aws:sns:us-east-1:894947205914:ryandbrown-decryption-events" -> (known after apply) # forces replacement
      ~ id     = "arn:aws:sns:us-east-1:894947205914:ryandbrown-decryption-events" -> (known after apply)
      ~ owner  = "894947205914" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Id        = "kms_ct_sqs"
              - Statement = [
                  - {
                      - Action    = "SNS:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:894947205914:ryandbrown-decryption-events"
                      - Sid       = "KMSCTSQS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.kms_keymaker_multiregion_replica_ue1.aws_sns_topic_subscription.kms_ct_sqs must be replaced
-/+ resource "aws_sns_topic_subscription" "kms_ct_sqs" {
      ~ arn                             = "arn:aws:sns:us-east-1:894947205914:ryandbrown-decryption-events:f971b7e7-e6e8-4215-8b8d-410f68d23deb" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:894947205914:ryandbrown-decryption-events:f971b7e7-e6e8-4215-8b8d-410f68d23deb" -> (known after apply)
      ~ owner_id                        = "894947205914" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ topic_arn                       = "arn:aws:sns:us-east-1:894947205914:ryandbrown-decryption-events" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.migration_launch_template.aws_launch_template.template will be updated in-place
  ~ resource "aws_launch_template" "template" {
        id                                   = "lt-0d3f6421363522d86"
      ~ image_id                             = "ami-0abcba810fbc96527" -> "ami-0f508feb92d46e704"
      ~ latest_version                       = 2 -> (known after apply)
        name                                 = "ryandbrown-migration2023041918172254100000002c"
        tags                                 = {
            "domain"       = "ryandbrown.identitysandbox.gov"
            "main_git_ref" = "stages/ryandbrown"
            "prefix"       = "migration"
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.outboundproxy_cloudwatch_filters.aws_cloudwatch_metric_alarm.squid_denied_alarm will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "squid_denied_alarm" {
        id                        = "ryandbrown-squid-denials"
        tags                      = {}
      ~ treat_missing_data        = "notBreaching" -> "breaching"
        # (17 unchanged attributes hidden)
    }

  # module.outboundproxy_cloudwatch_filters.aws_cloudwatch_metric_alarm.squid_total_requests will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "squid_total_requests" {
        id                        = "ryandbrown-squid-total-requests"
        tags                      = {}
      ~ treat_missing_data        = "notBreaching" -> "breaching"
        # (17 unchanged attributes hidden)
    }

  # module.outboundproxy_launch_template.aws_launch_template.template will be updated in-place
  ~ resource "aws_launch_template" "template" {
        id                                   = "lt-003bfa907f02073cc"
      ~ image_id                             = "ami-07a4769a24bc10fa5" -> "ami-0309c5656af8193c3"
      ~ latest_version                       = 2 -> (known after apply)
        name                                 = "ryandbrown-outboundproxy2023041918172257410000002e"
        tags                                 = {
            "domain"       = "ryandbrown.identitysandbox.gov"
            "main_git_ref" = "stages/ryandbrown"
            "prefix"       = "outboundproxy"
        }
        # (16 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.pivcac_launch_template.aws_launch_template.template will be updated in-place
  ~ resource "aws_launch_template" "template" {
        id                                   = "lt-0dd4e9501ff97a186"
      ~ image_id                             = "ami-0abcba810fbc96527" -> "ami-0f508feb92d46e704"
      ~ latest_version                       = 2 -> (known after apply)
        name                                 = "ryandbrown-pivcac20230419181714345500000029"
        tags                                 = {
            "domain"       = "ryandbrown.identitysandbox.gov"
            "main_git_ref" = "stages/ryandbrown"
            "prefix"       = "pivcac"
        }
        # (16 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.worker_launch_template.aws_launch_template.template will be updated in-place
  ~ resource "aws_launch_template" "template" {
        id                                   = "lt-079cc6c6da2806e12"
      ~ image_id                             = "ami-0abcba810fbc96527" -> "ami-0f508feb92d46e704"
      ~ latest_version                       = 2 -> (known after apply)
        name                                 = "ryandbrown-worker20230419182035032100000042"
        tags                                 = {
            "domain"       = "ryandbrown.identitysandbox.gov"
            "main_git_ref" = "stages/ryandbrown"
            "prefix"       = "worker"
        }
        # (16 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.env-runner[0].module.gitlab_runner_launch_template.aws_launch_template.template will be updated in-place
  ~ resource "aws_launch_template" "template" {
        id                                   = "lt-0c60447a6a3f78453"
      ~ image_id                             = "ami-07a4769a24bc10fa5" -> "ami-0309c5656af8193c3"
      ~ latest_version                       = 2 -> (known after apply)
        name                                 = "ryandbrown-gitlab-env-runner2023041918230946400000004d"
        tags                                 = {
            "domain"       = "ryandbrown.identitysandbox.gov"
            "main_git_ref" = "stages/ryandbrown"
            "prefix"       = "gitlab-env-runner"
        }
        # (16 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.env-runner[0].module.outbound_proxy.module.outboundproxy_cloudwatch_filters.aws_cloudwatch_metric_alarm.squid_denied_alarm will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "squid_denied_alarm" {
        id                        = "ryandbrown-squid-denials"
        tags                      = {}
      ~ treat_missing_data        = "notBreaching" -> "missing"
        # (17 unchanged attributes hidden)
    }

  # module.env-runner[0].module.outbound_proxy.module.outboundproxy_cloudwatch_filters.aws_cloudwatch_metric_alarm.squid_total_requests will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "squid_total_requests" {
        id                        = "ryandbrown-squid-total-requests"
        tags                      = {}
      ~ treat_missing_data        = "notBreaching" -> "missing"
        # (17 unchanged attributes hidden)
    }

  # module.env-runner[0].module.outbound_proxy.module.outboundproxy_launch_template.aws_launch_template.template will be updated in-place
  ~ resource "aws_launch_template" "template" {
        id                                   = "lt-0ac7634843fd4d8ad"
      ~ image_id                             = "ami-07a4769a24bc10fa5" -> "ami-0309c5656af8193c3"
      ~ latest_version                       = 2 -> (known after apply)
        name                                 = "ryandbrown-env-runner-outboundproxy20230419182153878700000048"
        tags                                 = {
            "domain"       = "ryandbrown.identitysandbox.gov"
            "main_git_ref" = "stages/ryandbrown"
            "prefix"       = "env-runner-outboundproxy"
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 10 to add, 14 to change, 11 to destroy.